package com.example.foodpart.fooddata

data class FoodData(
    val foodName: String,
    val recipes: String,
    val id: Int,
    val difficulty: String,
    val cookingTime: String,
    val category: String,
    val subCategory: String,
    val meals: List<String>
)

val foodList = listOf<FoodData>(
    FoodData(
        "قیمه بادمجان", "مواد لازم:... ", 1, "متوسط", "۱ ساعت", "غذای اصلی", "خورشت",
        listOf("نهار", "صبحانه")
    ),
    FoodData(
        "کباب کوبیده",
        "مواد لازم:...",
        2,
        "ساده",
        "۴۵ دقیقه",
        "غذای اصلی",
        "سنتی",
        listOf("صبحانه")
    ),
    FoodData(
        "فسنجان",
        "مواد لازم:...",
        3,
        "پیچیده",
        "۲ ساعت",
        "غذای اصلی",
        "خورشت",
        listOf("نهار", "شام")
    ),
    FoodData(
        "آب‌پزخورشت",
        "مواد لازم:...",
        4,
        "ساده",
        "۴۰ دقیقه",
        "غذای اصلی",
        "سنتی",
        listOf("نهار", "شام")
    ),
    FoodData(
        "کوکو سبزی",
        "مواد لازم:...",
        5,
        "آسان",
        "۴۵ دقیقه",
        "غذای اصلی",
        "خورشت",
        listOf("صبحانه", "نهار")
    ),
    FoodData(
        "شوید باقالی",
        "مواد لازم:...",
        6,
        "متوسط",
        "۷۰ دقیقه",
        "غذای اصلی",
        "سنتی",
        listOf("نهار")
    ),
    FoodData(
        "سیب‌زمینی خورشت",
        "مواد لازم:...",
        7,
        "پیچیده",
        "۲ ساعت و ۳۰ دقیقه",
        "غذای اصلی",
        "خورشت", listOf("شام", "نهار")
    ),
    FoodData(
        "ماکارونی",
        "مواد لازم:...",
        8,
        "آسان",
        "۳۰ دقیقه",
        "غذای اصلی",
        "ملل",
        listOf("شام", "نهار")
    ),
    FoodData(
        "خورشت قیمه",
        "مواد لازم:...",
        9,
        "پیچیده",
        "۳ ساعت",
        "غذای اصلی",
        "خورشت",
        listOf("شام", "نهار")
    ),
    FoodData(
        "لوبیا پلو",
        "مواد لازم:...",
        10,
        "متوسط",
        "۲ ساعت و ۳۰ دقیقه",
        "غذای اصلی",
        "خورشت",
        listOf("شام", "نهار")
    ),
    FoodData(
        "میرزاقاسمی",
        "مواد لازم:...",
        11,
        "پیچیده",
        "۴ ساعت",
        "غذای اصلی",
        "خورشت",
        listOf("شام", "نهار")
    ),
    FoodData(
        "ته‌چین",
        "مواد لازم:...",
        12,
        "آسان",
        "۵۰ دقیقه",
        "غذای اصلی",
        "خورشت",
        listOf("شام", "نهار")
    ),
    FoodData(
        "آش رشته",
        "مواد لازم:...",
        13,
        "متوسط",
        "۱ ساعت و ۱۵ دقیقه",
        "غذای اصلی",
        "خورشت",
        listOf("شام", "نهار")
    ),
    FoodData(
        "کشک بادمجان",
        "مواد لازم:...",
        14,
        "ساده",
        "۴۵ دقیقه",
        "غذای اصلی",
        "خورشت",
        listOf("شام", "نهار")
    ),
    FoodData(
        "سالاد اسفناج",
        "مواد لازم:...",
        15,
        "آسان",
        "۲۰ دقیقه",
        "سالاد",
        "خورشت",
        listOf("شام", "نهار")
    )
)
