package com.example.foodpart.fooddata

data class FoodData(
    val foodName: String,
    val recipes: String,
    val id: Int,
    val difficulty: String,
    val cookingTime: String,
    val category: String,
    val subCategory: String
)
    val foodList = listOf<FoodData>(
        FoodData("قیمه بادمجان", "مواد لازم:... ", 1, "متوسط", "۱ ساعت", "غذای اصلی","خورشت"),
        FoodData("کباب کوبیده", "مواد لازم:...", 2, "ساده", "۴۵ دقیقه", "غذای اصلی","سنتی"),
        FoodData("فسنجان", "مواد لازم:...", 3, "پیچیده", "۲ ساعت", "غذای اصلی","خورشت"),
        FoodData("آب‌پزخورشت", "مواد لازم:...", 4, "ساده", "۴۰ دقیقه", "غذای اصلی","سنتی"),
        FoodData("کوکو سبزی", "مواد لازم:...", 5, "آسان", "۴۵ دقیقه", "غذای اصلی","خورشت"),
        FoodData("شوید باقالی", "مواد لازم:...", 6, "متوسط", "۷۰ دقیقه", "غذای اصلی","سنتی"),
        FoodData("سیب‌زمینی خورشت", "مواد لازم:...", 7, "پیچیده", "۲ ساعت و ۳۰ دقیقه", "غذای اصلی","خورشت"),
        FoodData("ماکارونی", "مواد لازم:...", 8, "آسان", "۳۰ دقیقه", "غذای اصلی","ملل"),
        FoodData("خورشت قیمه", "مواد لازم:...", 9, "پیچیده", "۳ ساعت", "غذای اصلی","خورشت"),
        FoodData("لوبیا پلو", "مواد لازم:...", 10, "متوسط", "۲ ساعت و ۳۰ دقیقه", "غذای اصلی","خورشت"),
        FoodData("میرزاقاسمی", "مواد لازم:...", 11, "پیچیده", "۴ ساعت", "غذای اصلی","خورشت"),
        FoodData("ته‌چین", "مواد لازم:...", 12, "آسان", "۵۰ دقیقه", "غذای اصلی","خورشت"),
        FoodData("آش رشته", "مواد لازم:...", 13, "متوسط", "۱ ساعت و ۱۵ دقیقه", "غذای اصلی","خورشت"),
        FoodData("کشک بادمجان", "مواد لازم:...", 14, "ساده", "۴۵ دقیقه", "غذای اصلی","خورشت"),
        FoodData("سالاد اسفناج", "مواد لازم:...", 15, "آسان", "۲۰ دقیقه", "سالاد","خورشت")
    )
